In [1]:
people={"first":["Rajat","corey","John"],
        "last":["Gupta","sch","doe"],
        "email":["RajatGupta@email.com","corey@email.com","john@email.com"]}
import pandas as pd
df=pd.read_csv("survey_results_public.csv")
df2=pd.DataFrame(people)
schema_df=pd.read_csv("survey_results_schema.csv")

In [2]:
df.columns

Index(['Respondent', 'MainBranch', 'Hobbyist', 'Age', 'Age1stCode', 'CompFreq',
       'CompTotal', 'ConvertedComp', 'Country', 'CurrencyDesc',
       'CurrencySymbol', 'DatabaseDesireNextYear', 'DatabaseWorkedWith',
       'DevType', 'EdLevel', 'Employment', 'Ethnicity', 'Gender', 'JobFactors',
       'JobSat', 'JobSeek', 'LanguageDesireNextYear', 'LanguageWorkedWith',
       'MiscTechDesireNextYear', 'MiscTechWorkedWith',
       'NEWCollabToolsDesireNextYear', 'NEWCollabToolsWorkedWith', 'NEWDevOps',
       'NEWDevOpsImpt', 'NEWEdImpt', 'NEWJobHunt', 'NEWJobHuntResearch',
       'NEWLearn', 'NEWOffTopic', 'NEWOnboardGood', 'NEWOtherComms',
       'NEWOvertime', 'NEWPurchaseResearch', 'NEWPurpleLink', 'NEWSOSites',
       'NEWStuck', 'OpSys', 'OrgSize', 'PlatformDesireNextYear',
       'PlatformWorkedWith', 'PurchaseWhat', 'Sexuality', 'SOAccount',
       'SOComm', 'SOPartFreq', 'SOVisitFreq', 'SurveyEase', 'SurveyLength',
       'Trans', 'UndergradMajor', 'WebframeDesireNextYear',
       'WebframeWorkedWith', 'WelcomeChange', 'WorkWeekHrs', 'YearsCode',
       'YearsCodePro'],
      dtype='object')

In [3]:
df2.columns

Index(['first', 'last', 'email'], dtype='object')

In [4]:
df2.columns=["first_name","last_column","email"]

In [5]:
df2

  first_name last_column                 email
0      Rajat       Gupta  RajatGupta@email.com
1      corey         sch       corey@email.com
2       John         doe        john@email.com

In [6]:
df2.columns=[x.upper() for x in df2.columns]

In [7]:
df2.columns

Index(['FIRST_NAME', 'LAST_COLUMN', 'EMAIL'], dtype='object')

In [8]:
df2.replace("sch","doe",inplace=True)

In [9]:
df2

  FIRST_NAME LAST_COLUMN                 EMAIL
0      Rajat       Gupta  RajatGupta@email.com
1      corey         doe       corey@email.com
2       John         doe        john@email.com

In [10]:
df2.columns.str.replace("_"," ")

Index(['FIRST NAME', 'LAST COLUMN', 'EMAIL'], dtype='object')

In [11]:
df2.columns=df2.columns.str.replace("_"," ")

In [12]:
df2

  FIRST NAME LAST COLUMN                 EMAIL
0      Rajat       Gupta  RajatGupta@email.com
1      corey         doe       corey@email.com
2       John         doe        john@email.com

In [13]:
df2.columns=df2.columns.str.replace(" ","_")

In [14]:
df2

  FIRST_NAME LAST_COLUMN                 EMAIL
0      Rajat       Gupta  RajatGupta@email.com
1      corey         doe       corey@email.com
2       John         doe        john@email.com

In [15]:
df2.columns=[x.lower() for x in df2.columns]

In [16]:
df2.rename(columns={"first_name":"first","last_column":"last"},inplace=True)

In [17]:
df2

   first   last                 email
0  Rajat  Gupta  RajatGupta@email.com
1  corey    doe       corey@email.com
2   John    doe        john@email.com

In [18]:
df2.loc[2]

first              John
last                doe
email    john@email.com
Name: 2, dtype: object

In [19]:
df2.loc[2]=["smith","doe","smith@email.com"]

In [20]:
df2

   first   last                 email
0  Rajat  Gupta  RajatGupta@email.com
1  corey    doe       corey@email.com
2  smith    doe       smith@email.com

In [21]:
df2.loc[2,["first","email"]]=["john","john@email.com"]

In [22]:
df2

   first   last                 email
0  Rajat  Gupta  RajatGupta@email.com
1  corey    doe       corey@email.com
2   john    doe        john@email.com

In [23]:
df2["last"][[1,2]]

1    doe
2    doe
Name: last, dtype: object

In [24]:
df2["last"][[1,2]]=["Doe","Doe"]

In [25]:
df2

   first   last                 email
0  Rajat  Gupta  RajatGupta@email.com
1  corey    Doe       corey@email.com
2   john    Doe        john@email.com

In [26]:
filt=(df2["email"]=="corey@email.com")

In [27]:
df2[filt]

   first last            email
1  corey  Doe  corey@email.com

In [28]:
df2[filt]["first"]="Corey"

<ipython-input-28-42d8265cd02b>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df2[filt]["first"]="Corey"

In [29]:
df2.loc[filt,"first"]="Corey"

In [30]:
df2

   first   last                 email
0  Rajat  Gupta  RajatGupta@email.com
1  Corey    Doe       corey@email.com
2   john    Doe        john@email.com

In [31]:
df2.at[0,"first"]="RAJAT"

In [32]:
df2

   first   last                 email
0  RAJAT  Gupta  RajatGupta@email.com
1  Corey    Doe       corey@email.com
2   john    Doe        john@email.com

In [33]:
df2.at[0,["first","last"]]=["RAJAT","GUPTA"]

In [34]:
df2

   first   last                 email
0  RAJAT  GUPTA  RajatGupta@email.com
1  Corey    Doe       corey@email.com
2   john    Doe        john@email.com

In [35]:
df2["email"]=df2["email"].str.lower()

In [36]:
df2

   first   last                 email
0  RAJAT  GUPTA  rajatgupta@email.com
1  Corey    Doe       corey@email.com
2   john    Doe        john@email.com

In [37]:
df2["email"].apply(len)

0    20
1    15
2    14
Name: email, dtype: int64

In [38]:
def update_email(x):
    return x.upper()

In [39]:
df2["email"].apply(update_email)

0    RAJATGUPTA@EMAIL.COM
1         COREY@EMAIL.COM
2          JOHN@EMAIL.COM
Name: email, dtype: object

In [40]:
df2["email"]=df2["email"].apply(update_email)

In [41]:
df2

   first   last                 email
0  RAJAT  GUPTA  RAJATGUPTA@EMAIL.COM
1  Corey    Doe       COREY@EMAIL.COM
2   john    Doe        JOHN@EMAIL.COM

In [42]:
df2["email"].apply(lambda x:x.lower())

0    rajatgupta@email.com
1         corey@email.com
2          john@email.com
Name: email, dtype: object

In [43]:
df2["email"]=df2["email"].apply(lambda x:x.lower())

In [44]:
df2

   first   last                 email
0  RAJAT  GUPTA  rajatgupta@email.com
1  Corey    Doe       corey@email.com
2   john    Doe        john@email.com

In [45]:
df2.apply(len)

first    3
last     3
email    3
dtype: int64

In [46]:
df2["email"].apply(max)

0    u
1    y
2    o
Name: email, dtype: object

In [47]:
df2.apply(max)

first                    john
last                    GUPTA
email    rajatgupta@email.com
dtype: object

In [48]:
df2

   first   last                 email
0  RAJAT  GUPTA  rajatgupta@email.com
1  Corey    Doe       corey@email.com
2   john    Doe        john@email.com

In [49]:
df2.applymap(len)

   first  last  email
0      5     5     20
1      5     3     15
2      4     3     14

In [50]:
df2.apply(pd.Series.min)

first              Corey
last                 Doe
email    corey@email.com
dtype: object

In [51]:
df2.apply(min)

first              Corey
last                 Doe
email    corey@email.com
dtype: object

In [52]:
df2.apply(lambda x : x.min())    #here x is series

first              Corey
last                 Doe
email    corey@email.com
dtype: object

In [53]:
df2.applymap(len)

   first  last  email
0      5     5     20
1      5     3     15
2      4     3     14

In [54]:
df2.applymap(str.lower)

   first   last                 email
0  rajat  gupta  rajatgupta@email.com
1  corey    doe       corey@email.com
2   john    doe        john@email.com

In [55]:
df2=df2.applymap(str.upper)

In [56]:
df2

   first   last                 email
0  RAJAT  GUPTA  RAJATGUPTA@EMAIL.COM
1  COREY    DOE       COREY@EMAIL.COM
2   JOHN    DOE        JOHN@EMAIL.COM

In [57]:
df2["first"].map({"COREY":"corey","JOHN":"john"})

0      NaN
1    corey
2     john
Name: first, dtype: object

In [58]:
#so we get null for those which not replace so we will use replace not toget nan

In [59]:
df2["first"].map(len)

0    5
1    5
2    4
Name: first, dtype: int64

In [60]:
df2.replace({"COREY":"corey","JOHN":"john"})

   first   last                 email
0  RAJAT  GUPTA  RAJATGUPTA@EMAIL.COM
1  corey    DOE       COREY@EMAIL.COM
2   john    DOE        JOHN@EMAIL.COM

In [61]:
df2["first"].replace({"COREY":"corey","JOHN":"john"})

0    RAJAT
1    corey
2     john
Name: first, dtype: object

In [62]:
df2["first"]=df2["first"].replace({"COREY":"corey","JOHN":"john"})

In [63]:
df2

   first   last                 email
0  RAJAT  GUPTA  RAJATGUPTA@EMAIL.COM
1  corey    DOE       COREY@EMAIL.COM
2   john    DOE        JOHN@EMAIL.COM

In [64]:
df["Hobbyist"]

0        Yes
1         No
2        Yes
3        Yes
4        Yes
        ...
64456    Yes
64457    Yes
64458    Yes
64459    Yes
64460    Yes
Name: Hobbyist, Length: 64461, dtype: object

In [65]:
df["Hobbyist"].value_counts()

Yes    50388
No     14028
Name: Hobbyist, dtype: int64

In [66]:
df["Hobbyist"]=df["Hobbyist"].map({"Yes":True,"No":False})

In [67]:
df["Hobbyist"]

0         True
1        False
2         True
3         True
4         True
         ...
64456     True
64457     True
64458     True
64459     True
64460     True
Name: Hobbyist, Length: 64461, dtype: object

In [68]:
df["Hobbyist"].value_counts()

True     50388
False    14028
Name: Hobbyist, dtype: int64

In [69]:
df2["email"]=df2["email"].map(lambda x:x.upper())

In [70]:
df2

   first   last                 email
0  RAJAT  GUPTA  RAJATGUPTA@EMAIL.COM
1  corey    DOE       COREY@EMAIL.COM
2   john    DOE        JOHN@EMAIL.COM

In [71]:
df2.loc[0].apply(len)

first     5
last      5
email    20
Name: 0, dtype: int64

In [72]:
df2["first"].apply(len)

0    5
1    5
2    4
Name: first, dtype: int64

In [73]:
df2.apply(len)

first    3
last     3
email    3
dtype: int64

In [74]:
df2.apply(len,axis=1)

0    3
1    3
2    3
dtype: int64

In [75]:
df2.index=[4,5,6]

In [76]:
df2

   first   last                 email
4  RAJAT  GUPTA  RAJATGUPTA@EMAIL.COM
5  corey    DOE       COREY@EMAIL.COM
6   john    DOE        JOHN@EMAIL.COM